[
    {
      "id": 1,
      "name": "Bench Press",
      "target_muscle_group": "Chest",
      "description": "A compound exercise that targets the chest, shoulders, and triceps. Performed using a barbell or dumbbells on a flat bench."
    },
    {
      "id": 2,
      "name": "Squat",
      "target_muscle_group": "Legs",
      "description": "A fundamental lower-body exercise that strengthens the quadriceps, hamstrings, and glutes by lowering and raising the body from a squat position."
    },
    {
      "id": 3,
      "name": "Deadlift",
      "target_muscle_group": "Back",
      "description": "A full-body movement that primarily targets the lower back, hamstrings, and glutes by lifting a weighted barbell from the floor."
    },
    {
      "id": 4,
      "name": "Pull-Up",
      "target_muscle_group": "Back",
      "description": "A bodyweight exercise that targets the upper back and biceps by pulling the body up to a bar until the chin is above it."
    },
    {
      "id": 5,
      "name": "Shoulder Press",
      "target_muscle_group": "Shoulders",
      "description": "A pressing movement that strengthens the deltoids and triceps by pushing a weight overhead."
    },
    {
      "id": 6,
      "name": "Bicep Curl",
      "target_muscle_group": "Arms",
      "description": "An isolation exercise that targets the biceps by curling a dumbbell or barbell toward the shoulders."
    },
    {
      "id": 7,
      "name": "Tricep Dips",
      "target_muscle_group": "Arms",
      "description": "A bodyweight exercise that targets the triceps by lowering and raising the body using parallel bars."
    },
    {
      "id": 8,
      "name": "Lunges",
      "target_muscle_group": "Legs",
      "description": "A unilateral leg exercise that improves balance and strength by stepping forward and lowering the body before returning to the start position."
    },
    {
      "id": 9,
      "name": "Plank",
      "target_muscle_group": "Core",
      "description": "An isometric core exercise that strengthens the abs, lower back, and shoulders by holding a push-up position for time."
    },
    {
      "id": 10,
      "name": "Russian Twists",
      "target_muscle_group": "Core",
      "description": "A rotational core exercise that targets the obliques by twisting the torso from side to side while seated."
    }
  ]
  